# Data Analysis: Panda series Part 2
# DataFrames: Better representation in rows and columns

In [4]:
import pandas as pd

<h3>DataFrame usig  List</h3>

In [9]:
# 1-D list
l1 = [1,5,3,4]
a = pd.DataFrame(l1)
a

   0
0  1
1  5
2  3
3  4

In [10]:
# 2-D list
l2 = [[1,3,5],[0,2,4]]
b  = pd.DataFrame(l2)
b

   0  1  2
0  1  3  5
1  0  2  4

<h3>DataFrame using Dictionary</h3>

In [24]:
d = {'Roll no':pd.Series([2,3,1,4]),
     'Name':pd.Series(["lhasang","Nirmal","Nabin","Manav"]),
     'CGPA':pd.Series([3.6,3.7,3.2,3.4])
    }
data = pd.DataFrame(d,)
data

   Roll no     Name  CGPA
0        2  lhasang   3.6
1        3   Nirmal   3.7
2        1    Nabin   3.2
3        4    Manav   3.4

In [27]:
max(data['CGPA'])

3.7

In [31]:
print(data['Name'])

0    lhasang
1     Nirmal
2      Nabin
3      Manav
Name: Name, dtype: object

<h3>DataFrame using CSV(Comma Separated Values)</h3>

In [33]:
# Reading CSV as DataFrame
df = pd.read_csv(r"music.csv")
df

    age  gender    genre
0    22       1     Jazz
1    36       1      Pop
2    40       1  Hip-Hop
3    26       0     Jazz
4    30       0      Pop
..  ...     ...      ...
95   53       1      Pop
96   19       1     Rock
97   41       1  Hip-Hop
98   29       0     Jazz
99   52       1  Hip-Hop

[100 rows x 3 columns]

In [42]:
min(df['age'])

18

In [43]:
type(df)

pandas.core.frame.DataFrame

# DataFrame Functions
<h4>Basic Functions:</h4>

In [46]:
# we do have a dataframe in variable df 
# columns gives the list of columns
df.columns

Index(['age', 'gender', 'genre'], dtype='object')

In [47]:
# gives tuple(rows, columns)
df.shape

(100, 3)

In [52]:
# size : gives the number of cells in csv file
df.size

300

<h4>Important DataFrame Functions</h4>

In [50]:
# head(): gives the 5 rows
df.head()

   age  gender    genre
0   22       1     Jazz
1   36       1      Pop
2   40       1  Hip-Hop
3   26       0     Jazz
4   30       0      Pop

In [53]:
# tail(): gives the 5 bottom rows
df.tail()

    age  gender    genre
95   53       1      Pop
96   19       1     Rock
97   41       1  Hip-Hop
98   29       0     Jazz
99   52       1  Hip-Hop

In [54]:
# describe(): Description of numerical data
df.describe()

              age      gender
count  100.000000  100.000000
mean    40.780000    0.530000
std     13.093741    0.501614
min     18.000000    0.000000
25%     30.000000    0.000000
50%     40.500000    1.000000
75%     52.000000    1.000000
max     65.000000    1.000000

In [55]:
# info(): basic information 
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   age     100 non-null    int64
 1   gender  100 non-null    int64
 2   genre   100 non-null    object
dtypes: int64(2), object(1)
memory usage: 2.5+ KB